Revit 2027 API
NavisworksExportOptions.ExportElementIds Property
 True to export Revit element ids, false to skip these values. Default value is true.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool ExportElementIds { get; set; }
Public Property ExportElementIds As Boolean
	Get
	Set
public:
property bool ExportElementIds {
	bool get ();
	void set (bool value);
}
member ExportElementIds : bool with get, set
Property Value
Boolean
See Also
Reference
NavisworksExportOptions Class
Autodesk.Revit.DB Namespace